{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [null, 224, 224, 3],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "filters": 32,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "same",
                            "activation": "linear",
                            "use_bias": false
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "axis": -1
                        }
                    },
                    {
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu",
                            "trainable": true,
                            "negative_slope": 0.1
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2]
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "units": 512,
                            "activation": "linear",
                            "use_bias": false
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "output_layer",
                            "trainable": true,
                            "units": 9,
                            "activation": "softmax",
                            "use_bias": true
                        }
                    }
                ]
            }
        }
    }
}
